app/models/shortened_url.rb

    def self.random_code
        code = nil
        code = SecureRandom.urlsafe_base64(16) while ShortenedUrl.exists?(short_url:code) || code == nil
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "ve4nabLrmQxGs66ThCna8Q"], ["LIMIT", 1]]

    def self.generate_short_url(user,long_url)
        code = random_code
        ShortenedUrl.create!(short_url:code,long_url:long_url,user_id:user.id)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def self.prune(n)
        ShortenedUrl.joins(:submitter).where("shortened_urls.created_at < ? AND users.premium = ? AND shortened_urls.id NOT IN (?)",
            Time.now - n.minutes,false,
            ShortenedUrl
            .select("shortened_urls.id")
            .joins(:visits)
            .where("visits.created_at > ?",
            Time.now - n.minutes)).destroy_all
---
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 187]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 332]]