app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["shortened_url_id", 25], ["created_at", "2021-07-08 18:20:54.216128"], ["updated_at", "2021-07-08 18:20:54.216128"]]
---
    def self.record_visit!(user,shortened_url)
        Visit.create!(user_id:user.id,shortened_url_id:shortened_url.id)